# -*- coding: utf-8 -*-
"""Transliterates Amharic Ge'ez script into Latin/English representation."""

TRANSLIT_MAP = {
    'ሀ': 'ha', 'ሁ': 'hu', 'ሂ': 'hi', 'ሃ': 'ha', 'ሄ': 'he', 'ህ': 'he', 'ሆ': 'ho',
    'ለ': 'la', 'ሉ': 'lu', 'ሊ': 'li', 'ላ': 'la', 'ሌ': 'le', 'ል': 'le', 'ሎ': 'lo',
    'መ': 'ma', 'ሙ': 'mu', 'ሚ': 'mi', 'ማ': 'ma', 'ሜ': 'me', 'ም': 'me', 'ሞ': 'mo',
    'ሰ': 'sa', 'ሱ': 'su', 'ሲ': 'si', 'ሳ': 'sa', 'ሴ': 'se', 'ስ': 'se', 'ሶ': 'so',
    'ረ': 'ra', 'ሩ': 'ru', 'ሪ': 'ri', 'ራ': 'ra', 'ሬ': 're', 'ር': 're', 'ሮ': 'ro',
    'ቀ': 'qa', 'ቁ': 'qu', 'ቂ': 'qi', 'ቃ': 'qa', 'ቄ': 'qe', 'ቅ': 'qe', 'ቆ': 'qo',
    'በ': 'ba', 'ቡ': 'bu', 'ቢ': 'bi', 'ባ': 'ba', 'ቤ': 'be', 'ብ': 'be', 'ቦ': 'bo',
    'ተ': 'ta', 'ቱ': 'tu', 'ቲ': 'ti', 'ታ': 'ta', 'ቴ': 'te', 'ት': 'te', 'ቶ': 'to',
    'ነ': 'na', 'ኑ': 'nu', 'ኒ': 'ni', 'ና': 'na', 'ኔ': 'ne', 'ን': 'ne', 'ኖ': 'no',
    'አ': 'a', 'ኡ': 'u', 'ኢ': 'i', 'ኣ': 'a', 'ኤ': 'e', 'እ': 'e', 'ኦ': 'o',
    'ከ': 'ka', 'ኩ': 'ku', 'ኪ': 'ki', 'ካ': 'ka', 'ኬ': 'ke', 'ክ': 'ke', 'ኮ': 'ko',
    'ወ': 'wa', 'ዉ': 'wu', 'ዊ': 'wi', 'ዋ': 'wa', 'ዌ': 'we', 'ው': 'we', 'ዎ': 'wo',
    'ዘ': 'za', 'ዙ': 'zu', 'ዚ': 'zi', 'ዛ': 'za', 'ዜ': 'ze', 'ዝ': 'ze', 'ዞ': 'zo',
    'የ': 'ya', 'ዩ': 'yu', 'ይ': 'yi', 'ያ': 'ya', 'ዬ': 'ye', 'ይ': 'ye', 'ዮ': 'yo',
    'ደ': 'da', 'ዱ': 'du', 'ዲ': 'di', 'ዳ': 'da', 'ዴ': 'de', 'ድ': 'de', 'ዶ': 'do',
    'ገ': 'ga', 'ጉ': 'gu', 'ጊ': 'gi', 'ጋ': 'ga', 'ጌ': 'ge', 'ግ': 'ge', 'ጎ': 'go',
    'ጠ': 'ta', 'ጡ': 'tu', 'ጢ': 'ti', 'ጣ': 'ta', 'ጤ': 'te', 'ጥ': 'te', 'ጦ': 'to',
    'ጨ': 'cha', 'ጩ': 'chu', 'ጪ': 'chi', 'ጫ': 'cha', 'ጬ': 'che', 'ጭ': 'che', 'ጮ': 'cho',
    'ጰ': 'pa', 'ጱ': 'pu', 'ጲ': 'pi', 'ጳ': 'pa', 'ጴ': 'pe', 'ጵ': 'pe', 'ጶ': 'po',
    'ጸ': 'tsa', 'ጹ': 'tsu', 'ጺ': 'tsi', 'ጻ': 'tsa', 'ጼ': 'tse', 'ጽ': 'tse', 'ጾ': 'tso',
    'ፈ': 'fa', 'ፉ': 'fu', 'ፊ': 'fi', 'ፋ': 'fa', 'ፌ': 'fe', 'ፍ': 'fe', 'ፎ': 'fo',
    'ፐ': 'pa', 'ፑ': 'pu', 'ፒ': 'pi', 'ፓ': 'pa', 'ፔ': 'pe', 'ፕ': 'pe', 'ፖ': 'po',
}

def transliterate(text: str) -> str:
    res = []
    for char in text:
        res.append(TRANSLIT_MAP.get(char, char))
    return "".join(res)
